Tekla Open API Reference for Tekla Structures 2025
HierarchicObject Properties
The HierarchicObject type exposes the following members.
Properties
Name | Description
Definition
 The hierarchical definition which the hierarchical object is associated with.
Father
 The father of the hierarchical object.
HierarchicChildren
 An array list that contains the hierarchical object's hierarchical children (of the type hierarchical object).
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the hierarchical object.
Top
See Also
Reference
HierarchicObject Class
Tekla.Structures.Model Namespace